#+LaTeX_HEADER: \usepackage{algorithm}
#+LaTeX_HEADER: \usepackage{siunitx}
#+LaTeX_HEADER: \usepackage{algpseudocode}
#+LaTeX_HEADER: \usepackage{amsthm}
#+LaTeX_HEADER: \renewcommand{\eqref}[1]{Eq. (\ref{#1})}
#+LaTeX_HEADER: \newtheorem{acknowledgment}{Acknowledgment}
#+LaTeX_HEADER: \newtheorem{assertion}{Assertion}
#+LaTeX_HEADER: \newtheorem{assumption}{Assumption}
#+LaTeX_HEADER: \newtheorem{axiom}{Axiom}
#+LaTeX_HEADER: \newtheorem{case}{Case}
#+LaTeX_HEADER: \newtheorem{claim}{Claim}
#+LaTeX_HEADER: \newtheorem{conclusion}{Conclusion}
#+LaTeX_HEADER: \newtheorem{condition}{Condition}
#+LaTeX_HEADER: \newtheorem{conjecture}{Conjecture}
#+LaTeX_HEADER: \newtheorem{corollary}{Corollary}
#+LaTeX_HEADER: \newtheorem{criterion}{Criterion}
#+LaTeX_HEADER: \newtheorem{definition}{Definition}
#+LaTeX_HEADER: \newtheorem{example}{Example}
#+LaTeX_HEADER: \newtheorem{exercise}{Exercise}
#+LaTeX_HEADER: \newtheorem{hypothesis}{Hypothesis}
#+LaTeX_HEADER: \newtheorem{lemma}{Lemma}
#+LaTeX_HEADER: \newtheorem{notation}{Notation}
#+LaTeX_HEADER: \newtheorem{observation}{Observation}
#+LaTeX_HEADER: \newtheorem{problem}{Problem}
#+LaTeX_HEADER: \newtheorem{property}{Property}
#+LaTeX_HEADER: \newtheorem{proposition}{Proposition}
#+LaTeX_HEADER: \newtheorem{question}{Question}
#+LaTeX_HEADER: \newtheorem{remark}{Remark}
#+LaTeX_HEADER: \newtheorem{summary}{Summary}
#+LaTeX_HEADER: \newtheorem{theorem}{Theorem}
#+LaTeX_HEADER: \newtheorem{warning}{Warning}
*** Code execution

    See cref:code:test.

    #+caption: Casadi with gnuplot source code.
    #+name: code:test
    #+header: :results value
    #+header: :flags "-std=c++11 -fPIC"
    #+Header: :libs "-lstdc++"
    #+header: :includes (list "<fstream>" "<sstream>" "<iostream>" "<string>" "<vector>")
    #+header: :namespaces (list "std")
    #+header: :main no :exports both
    #+begin_src cpp +n 0
      int main(){

        std::cout << "Hello world" << std::endl;
        return 0;
      }
    #+end_src

    #+RESULTS: code:test
    : Hello world

